package io.gushizhao.design.structuralmode.composite;
/**
 * 组合模式
 * 一、概述
 * 将对象组合成树形结构以表示"部分-整体"的层次结构。"Composite使得用户对单个对象和组合对象的
 * 使用具有一致性。
 *
 * 二、适用性
 * 表示对象的部分-整体层次结构。
 * 希望用户忽略组合对象与单个对象的不同，用户将统一地使用组合结构中的所有对象。
 *
 * 三、参与者
 * Component 为组合中的对象声明接口。 在适当的情况下，实现所有类共有接口的缺省行为。 声
 * 明一个接口用于访问和管理Component的子组件。 (可选)在递归结构中定义一个接口，用于访问
 * 一个父部件，并在合适的情况下实现它。
 * Leaf 在组合中表示叶节点对象，叶节点没有子节点。 在组合中定义节点对象的行为。
 * Composite 定义有子部件的那些部件的行为。 存储子部件。 在Component接口中实现与子部件
 * 有关的操作。
 * Client 通过Component接口操纵组合部件的对象。
 *
 *
 *
 *
 *
 */